Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.ecr-scan-notification will be created
  + resource "aws_cloudwatch_event_rule" "ecr-scan-notification" {
      + arn            = (known after apply)
      + description    = "Triggers an event upon completition of ECR image scan"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + image-tags      = [
                      + "latest",
                    ]
                  + repository-name = [
                      + "qppsf/conversion-tool/dev",
                      + "qppsf/conversion-tool/impl",
                      + "qppsf/conversion-tool/devpre",
                      + "qppsf/conversion-tool/prod",
                    ]
                  + scan-status     = [
                      + "COMPLETE",
                    ]
                }
              + detail-type = [
                  + "ECR Image Scan",
                ]
              + source      = [
                  + "aws.ecr",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "ecr-scan-notification-qppsf-ct-dev"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.ecrevent-invoke-lambda will be created
  + resource "aws_cloudwatch_event_target" "ecrevent-invoke-lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ecr-scan-notification-qppsf-ct-dev"
      + target_id      = "ecr-scan-event-lambda"
    }

  # aws_iam_policy.lambda_cloudwatch_logging will be created
  + resource "aws_iam_policy" "lambda_cloudwatch_logging" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecr_lambda_cloudwatch_policy"
      + path      = "/delegatedadmin/developer/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.lambda_executionrole will be created
  + resource "aws_iam_role" "lambda_executionrole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecr-lambda-execrole-qppsf-ct-dev"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cloudwatchlogs-lambda will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatchlogs-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecr-lambda-execrole-qppsf-ct-dev"
    }

  # aws_lambda_function.ecr-lambda-notification will be created
  + resource "aws_lambda_function" "ecr-lambda-notification" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "ecr-lambda-notification.zip"
      + function_name                  = "ecr-lambda-notification"
      + handler                        = "ecr-lambda-notification.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "channel"  = "p-qpp-sub-alerts"
              + "hook_url" = ""
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "ecr-lambda-notification"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_ssm_parameter.slack_hook_url will be created
  + resource "aws_ssm_parameter" "slack_hook_url" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Slack Webhook Url for Scoring"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/qppar-sf/dev/conversion_tool/slack_hook_url"
      + overwrite   = true
      + tags        = {
          + "Name"        = "qppsf-ct-ssm-dev"
          + "application" = "Conversion-Tool"
          + "owner"       = "qppsf-scoring"
          + "project"     = "qppsf-ct"
          + "terraform"   = "true"
        }
      + tags_all    = {
          + "Name"        = "qppsf-ct-ssm-dev"
          + "application" = "Conversion-Tool"
          + "owner"       = "qppsf-scoring"
          + "project"     = "qppsf-ct"
          + "terraform"   = "true"
        }
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.